// Напишите метод, который принимает на вход координаты двух точек и находит расстояние между ними в 3D пространстве.
// A (3,6,8); B (2,1,-7), -> 15.84
// A (7,-5, 0); B (1,-1,9) -> 11.53

int x1 = ReadInt("Введите координату X первой точки: "); //ввод по точкам
int y1 = ReadInt("Введите координату Y первой точки: "); //ввод по точкам
int z1 = ReadInt("Введите координату Z первой точки: "); //ввод по точкам
int x2 = ReadInt("Введите координату X второй точки: "); //ввод по точкам
int y2 = ReadInt("Введите координату Y второй точки: "); //ввод по точкам
int z2 = ReadInt("Введите координату Z второй точки: "); //ввод по точкам

int A = x2 - x1;
int B = y2 - y1;
int C = z1 - z2;

double length = Math.Sqrt(A * A + B * B + C * C); //извл
Console.WriteLine($"Итого: {length}");

int ReadInt(string message)
{
    Console.Write(message);
    return Convert.ToInt32(Console.ReadLine());
}

